cases/pitzDaily/kOmega/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
12225
(
-0.0198086
-0.0182574
-0.0167681
-0.0153384
-0.0139658
-0.012648
-0.0113829
-0.0101683
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
-0.0206
-0.0206
-0.0206
-0.0206
-0.0206
-0.0206
-0.0206
-0.0206
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
57
(
0.29
0.29
0.29
0.29
0.29
0.29
0.29
0.29
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
223
(
-0.0198086
-0.0182574
-0.0167681
-0.0153384
-0.0139658
-0.012648
-0.0113829
-0.0101683
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
250
(
-0.0198086
-0.0182574
-0.0167681
-0.0153384
-0.0139658
-0.012648
-0.0113829
-0.0101683
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
